# Задание №1. Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке
# строк некое число.

# text = 'jnkjskdjb5kjfkj34', 'jhsbdfkjhsdb', '6534egfd', 'llskdjdh6464', '34'
# search = '34'

# for i in range(len(text)):
#     if search in text[i]:
#         print(f'в строке {i + 1} данная подстрока имеется')
#     else:
#         print(f'в строке {i + 1} данная подстрока не имеется')

# my_list = []
# my_list2 = []
# for i in range(len(text)):
#     if search in text[i]:
#         my_list.append(i)
#     else:
#         my_list2.append(i)
#
# print(f'данный эллемент присутствует в строках -> {my_list}')
# print(f'данный эллемент отствует в строках -> {my_list2}')